vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE17Z9_DFP.pdsc
    <condition id="allOf.anyOf=driver.lpuart, device=MKE17Z9.internal_condition">
      <require condition="anyOf.driver.lpuart.internal_condition"/>
      <require condition="device.MKE17Z9.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MKE17Z9.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MKE17Z9.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MKE17Z9.internal_condition">
      <require condition="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition"/>
      <require condition="device.MKE17Z9.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition">
      <accept condition="allOf.component.lpspi_adapter, driver.lpspi.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpspi_adapter, driver.lpspi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.anyOf=driver.lpuart, driver.uart, component.lpuart_adapter, device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpuart, driver.uart, component.lpuart_adapter, device=MKE17Z9.internal_condition">
      <require condition="anyOf.driver.lpuart, driver.uart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MKE17Z9.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart, driver.uart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="component.uart_adapter.condition_id">
      <require condition="allOf.driver.uart, device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.uart, device=MKE17Z9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.MKE17Z9.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MKE17Z9.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MKE17Z9.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MKE17Z9.internal_condition"/>
    </condition>
    <condition id="device_id.MKE17Z512xxx9.internal_condition">
      <accept Dname="MKE17Z512VLH9" Dvendor="NXP:11"/>
      <accept Dname="MKE17Z512VLL9" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device_id=MKE17Z512xxx9, driver.dmamux, driver.edma.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MKE17Z512xxx9, driver.dmamux, driver.edma.internal_condition">
      <require condition="device_id.MKE17Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MKE17Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MKE17Z512xxx9.internal_condition">
      <require condition="device_id.MKE17Z512xxx9.internal_condition"/>
    </condition>
    <condition id="device_ids.MKE17Z512xxx9.internal_condition">
      <accept Dname="MKE17Z512VLH9" Dvendor="NXP:11"/>
      <accept Dname="MKE17Z512VLL9" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MKE17Z512xxx9.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MKE17Z512xxx9.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MKE17Z512xxx9.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MKE17Z512xxx9.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MKE17Z512xxx9.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MKE17Z512xxx9.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=MKE17Z512xxx9, device.startup, driver.adc12, driver.clock, driver.common, driver.gpio, driver.lpi2c, driver.lpuart, driver.port, driver.smc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
