vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE17Z9_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MKE17Z9_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MKE17Z9_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MKE17Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z9/arm/MKE17Z512xxx9_flash.scf" version="1.0.0" projectpath="MKE17Z9/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MKE17Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z9/arm/MKE17Z512xxx9_ram.scf" version="1.0.0" projectpath="MKE17Z9/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE17Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z9/gcc/MKE17Z512xxx9_flash.ld" version="1.0.0" projectpath="MKE17Z9/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE17Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z9/gcc/MKE17Z512xxx9_ram.ld" version="1.0.0" projectpath="MKE17Z9/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE17Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z9/iar/MKE17Z512xxx9_flash.icf" version="1.0.0" projectpath="MKE17Z9/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE17Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE17Z9/iar/MKE17Z512xxx9_ram.icf" version="1.0.0" projectpath="MKE17Z9/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKE17Z9" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MKE17Z9</description>
      <files>
        <file category="header" attr="config" name="devices/MKE17Z9/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE17Z9/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE17Z9/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE17Z9/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE17Z9/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE17Z9/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE17Z9/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE17Z9/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MKE17Z9/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MKE17Z9_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MKE17Z9/iar/startup_MKE17Z9.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MKE17Z9/gcc/startup_MKE17Z9.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MKE17Z9/arm/startup_MKE17Z9.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MKE17Z9_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MKE17Z9_system</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/system_MKE17Z9.c" projectpath="device"/>
        <file category="header" name="devices/MKE17Z9/system_MKE17Z9.h" projectpath="device"/>
        <file category="include" name="devices/MKE17Z9/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.8" condition="driver.adc12.condition_id">
      <description>ADC12 Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_adc12.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_adc12.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.0.0" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.6.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MKE17Z9/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.12.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MKE17Z9/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MKE17Z9/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_uart.condition_id">
      <description>UART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MKE17Z9/cmsis_drivers/fsl_uart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/cmsis_drivers/fsl_uart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="sourceC" name="devices/MKE17Z9/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/MKE17Z9/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
