vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE17Z9_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.3" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.4.5" condition="driver.edma.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ewm" Cversion="2.0.4" condition="driver.ewm.condition_id">
      <description>EWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_ewm.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_ewm.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash" Cversion="3.3.0" condition="driver.flash.condition_id">
      <description>Flash Driver</description>
      <files>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_ftfx_adapter.h" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_ftfx_utilities.h" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_ftfx_features.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_ftfx_controller.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_ftfx_controller.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_ftfx_flash.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_ftfx_flash.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_ftfx_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_ftfx_cache.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_ftfx_flexnvm.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_ftfx_flexnvm.h" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_flash.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio" Cversion="2.3.0" condition="driver.flexio.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_flexio.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_flexio.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2c_master" Cversion="2.6.2" condition="driver.flexio_i2c_master.condition_id">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_flexio_i2c_master.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_flexio_i2c_master.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi" Cversion="2.4.3" condition="driver.flexio_spi.condition_id">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_flexio_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_flexio_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi_edma" Cversion="2.3.0" condition="driver.flexio_spi_edma.condition_id">
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_flexio_spi_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_flexio_spi_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart" Cversion="2.6.4" condition="driver.flexio_uart.condition_id">
      <description>FLEXIO UART Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_flexio_uart.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_flexio_uart.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart_edma" Cversion="2.4.1" condition="driver.flexio_uart_edma.condition_id">
      <description>FLEXIO UART EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE17Z9/drivers/fsl_flexio_uart_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE17Z9/drivers/fsl_flexio_uart_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE17Z9/drivers/"/>
      </files>
    </component>
